test_list_word_4 = [
        '日出三竿',
        '日出三杆',
        '日出三甘',

        '触目成诵',
        '触目成送',
        '触目成宋',

        '放歌纵酒',
        '放歌纵久',
        '放歌纵九',

        '精兵强将',
        '晶兵强将',
        '经兵强将',

        '漫山遍野',
        '漫山遍也',
        '漫山遍冶',

        '迫不及待',
        '迫不及带',
        '迫不及代',

        '青过于蓝',
        '青过于兰',
        '青过于栏',

        '人寿年丰',
        '人寿年风',
        '人寿年封',

        '世外桃源',
        '世外桃元',
        '世外桃原',

        '五体投地',
        '五体投第',
        '五体投弟',
]

test_list_word_3 = [
        '日出三竿',
        '日出叁竿',
        '日出弎竿',

        '触目成诵',
        '触目城诵',
        '触目程诵',

        '放歌纵酒',
        '放歌棕酒',
        '放歌综酒',

        '精兵强将',
        '精兵墙将',
        '精兵蔷将',

        '漫山遍野',
        '漫山变野',
        '漫山便野',

        '迫不及待',
        '迫不集待',
        '迫不即待',

        '青过于蓝',
        '青过鱼蓝',
        '青过余蓝',

        '人寿年丰',
        '人寿鲶丰',
        '人寿黏丰',

        '世外桃源',
        '世外淘源',
        '世外逃源',

        '五体投地',
        '五体头地',
        '五体頭地',
]

test_list_word_2 = [
        '日出三竿',
        '日初三竿',
        '日岀三竿',

        '触目成诵',
        '触木成诵',
        '触幕成诵',

        '放歌纵酒',
        '放哥纵酒',
        '放戈纵酒',

        '精兵强将',
        '精冰强将',
        '精梹强将',

        '漫山遍野',
        '漫衫遍野',
        '漫杉遍野',

        '迫不及待',
        '迫步及待',
        '迫布及待',

        '青过于蓝',
        '青過于蓝',
        '青鐹于蓝',

        '人寿年丰',
        '人受年丰',
        '人兽年丰',

        '世外桃源',
        '世䶐桃源',
        '世䠿桃源',

        '五体投地',
        '五骵投地',
        '五躰投地',
]

test_list_word_1 = [
        '日出三竿',
        '驲出三竿',
        '衵出三竿',

        '触目成诵',
        '㤘目成诵',
        '畜目成诵',

        '放歌纵酒',
        '放歌纵酒',
        '芳歌纵酒',

        '精兵强将',
        '惊兵强将',
        '菁兵强将',

        '漫山遍野',
        '慢山遍野',
        '蔓山遍野',

        '迫不及待',
        '破不及待',
        '魄不及待',

        '青过于蓝',
        '清过于蓝',
        '轻过于蓝',

        '人寿年丰',
        '仁寿年丰',
        '壬寿年丰',

        '世外桃源',
        '事外桃源',
        '是外桃源',

        '五体投地',
        '午体投地',
        '舞体投地',
]


test_list_word_1_2 = [
        '日出三竿',
        '驲初三竿',
        '衵岀三竿',

        '触目成诵',
        '㤘木成诵',
        '畜幕成诵',

        '放歌纵酒',
        '放哥纵酒',
        '芳戈纵酒',

        '精兵强将',
        '惊冰强将',
        '菁梹强将',

        '漫山遍野',
        '慢衫遍野',
        '蔓杉遍野',

        '迫不及待',
        '破步及待',
        '魄布及待',

        '青过于蓝',
        '清過于蓝',
        '轻鐹于蓝',

        '人寿年丰',
        '仁受年丰',
        '壬兽年丰',

        '世外桃源',
        '事䶐桃源',
        '是䠿桃源',

        '五体投地',
        '午骵投地',
        '舞躰投地',
]

test_list_word_3_4 = [
        '日出三竿',
        '日出叁杆',
        '日出弎甘',

        '触目成诵',
        '触目城送',
        '触目程宋',

        '放歌纵酒',
        '放歌棕久',
        '放歌综九',

        '精兵强将',
        '精兵墙将',
        '精兵蔷将',

        '漫山遍野',
        '漫山变也',
        '漫山便冶',

        '迫不及待',
        '迫不集带',
        '迫不即代',

        '青过于蓝',
        '青过鱼兰',
        '青过余栏',

        '人寿年丰',
        '人寿鲶风',
        '人寿黏封',

        '世外桃源',
        '世外淘元',
        '世外逃原',

        '五体投地',
        '五体头第',
        '五体頭弟',
]

test_list_tone_3_4 = [
        '日出三竿',
        '日出伞杆',
        '日出尚干',

        '触目成诵',
        '触目陈松',
        '触目城耸',

        '放歌纵酒',
        '放歌终究',
        '放歌综旧',

        '精兵强将',
        '精兵枪讲',
        '精兵锵江',

        '漫山遍野',
        '漫山编也',
        '漫山扁夜',

        '迫不及待',
        '迫不基傣',
        '迫不几呆',

        '青过于蓝',
        '青过预览',
        '青过玉兰',

        '人寿年丰',
        '人寿黏份',
        '人寿撵封',

        '世外桃源',
        '世外套渊',
        '世外涛远',

        '五体投地',
        '五体透底',
        '五体偷抵',
]


test_list_tone_1_2 = [
        '日出三竿',
        '移除三竿',
        '以触三竿',

        '触目成诵',
        '粗莫成诵',
        '促米成诵',

        '放歌纵酒',
        '翻个纵酒',
        '范格纵酒',

        '精兵强将',
        '筋饼强将',
        '近秉强将',

        '漫山遍野',
        '茫三遍野',
        '满散遍野',

        '迫不及待',
        '破补及待',
        '波铺及待',

        '青过于蓝',
        '琴果于蓝',
        '庆锅于蓝',

        '人寿年丰',
        '任首年丰',
        '韧熟年丰',

        '世外桃源',
        '司为桃源',
        '四歪桃源',

        '五体投地',
        '物替投地',
        '吴屉投地',
]


test_list_word_ = [
        '日出三竿',
        '日出三竿',
        '日出三竿',

        '触目成诵',
        '触目成诵',
        '触目成诵',

        '放歌纵酒',
        '放歌纵酒',
        '放歌纵酒',

        '精兵强将',
        '精兵强将',
        '精兵强将',

        '漫山遍野',
        '漫山遍野',
        '漫山遍野',

        '迫不及待',
        '迫不及待',
        '迫不及待',

        '青过于蓝',
        '青过于蓝',
        '青过于蓝',

        '人寿年丰',
        '人寿年丰',
        '人寿年丰',

        '世外桃源',
        '世外桃源',
        '世外桃源',

        '五体投地',
        '五体投地',
        '五体投地',
]




